In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame(
    {
        "FamilyName": [
            "Shah",
            "Vats",
            "Vats",
            "Kumar",
            "Vats",
            "Kumar",
            "Shah",
            "Shah",
            "Kumar",
            "Vats",
        ],
        "Gender": [
            "Male",
            "Male",
            "Female",
            "Female",
            "Female",
            "Male",
            "Male",
            "Female",
            "Female",
            "Male",
        ],
        "MonthlyIncome": [
            44000,
            65000,
            43150,
            66500,
            255000,
            103000,
            55000,
            112400,
            81030,
            71900,
        ],
    }
)
df

  FamilyName  Gender  MonthlyIncome
0       Shah    Male          44000
1       Vats    Male          65000
2       Vats  Female          43150
3      Kumar  Female          66500
4       Vats  Female         255000
5      Kumar    Male         103000
6       Shah    Male          55000
7       Shah  Female         112400
8      Kumar  Female          81030
9       Vats    Male          71900

In [3]:
df.groupby("FamilyName")["MonthlyIncome"].mean()

FamilyName
Kumar     83510.000000
Shah      70466.666667
Vats     108762.500000
Name: MonthlyIncome, dtype: float64

In [6]:
df.groupby("FamilyName")["MonthlyIncome"].agg(["max","min"])

               max    min
FamilyName
Kumar       103000  66500
Shah        112400  44000
Vats        255000  43150

In [11]:
print(df.loc[df["MonthlyIncome"] <= 80000])
df.loc[df["MonthlyIncome"] <= 80000].shape[0]

  FamilyName  Gender  MonthlyIncome
0       Shah    Male          44000
1       Vats    Male          65000
2       Vats  Female          43150
3      Kumar  Female          66500
6       Shah    Male          55000
9       Vats    Male          71900

6

In [14]:
print(df.loc[df["Gender"].str.contains("Female")])
df.loc[df["Gender"].str.contains("Female"),"MonthlyIncome"].mean()

  FamilyName  Gender  MonthlyIncome
2       Vats  Female          43150
3      Kumar  Female          66500
4       Vats  Female         255000
7       Shah  Female         112400
8      Kumar  Female          81030

np.float64(111616.0)

In [22]:
average_of_all = df.MonthlyIncome.mean()
to_drop = df[df["MonthlyIncome"] < average_of_all].index
# df.drop(to_drop,inplace=True)
df

  FamilyName  Gender  MonthlyIncome
4       Vats  Female         255000
5      Kumar    Male         103000
7       Shah  Female         112400